irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_dac_1795_IUT.c
CS_CMM_PROBE_NODE_STMT(51,3,1) 
 CODESCROLL_FUNC_END(93, 7, 112) } CODESCROLL_FUNC_END_RBRACE 
/* # 125 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dac.c"*/
void DAC_Init(uint32_t DAC_Channel, DAC_InitTypeDef* DAC_InitStruct)
{ CODESCROLL_FUNC_BEGIN(94, (94, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable241,245) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable242,51,2,0)

  uint32_t tmpreg1 = 0, tmpreg2 = 0;

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);


  tmpreg1 = ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->CR;

  tmpreg1 &= ~(((uint32_t)0x00000FFE) << DAC_Channel);






  tmpreg2 = (DAC_InitStruct->DAC_Trigger | DAC_InitStruct->DAC_WaveGeneration |
             DAC_InitStruct->DAC_LFSRUnmask_TriangleAmplitude | DAC_InitStruct->DAC_OutputBuffer);

  tmpreg1 |= tmpreg2 << DAC_Channel;

  ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->CR = tmpreg1;

CS_CMM_PROBE_NODE_STMT(51,1,1) 
 CODESCROLL_FUNC_END(94, 7, 150) } CODESCROLL_FUNC_END_RBRACE 







void DAC_StructInit(DAC_InitTypeDef* DAC_InitStruct)
{ CODESCROLL_FUNC_BEGIN(95, (95, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable243,246) 


  
  CS_CMM_PROBE_NODE_STMT(51,0,0) DAC_InitStruct->DAC_Trigger = ((uint32_t)0x00000000);

  DAC_InitStruct->DAC_WaveGeneration = ((uint32_t)0x00000000);

  DAC_InitStruct->DAC_LFSRUnmask_TriangleAmplitude = ((uint32_t)0x00000000);

  DAC_InitStruct->DAC_OutputBuffer = ((uint32_t)0x00000000);

CS_CMM_PROBE_NODE_STMT(52,7,1) 
 CODESCROLL_FUNC_END(95, 7, 169) } CODESCROLL_FUNC_END_RBRACE 
/* # 181 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dac.c"*/
void DAC_Cmd(uint32_t DAC_Channel, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(96, (96, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable244,247) 

  
  CS_CMM_PROBE_NODE_STMT(52,6,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(52,5,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable245,248) 

    
    CS_CMM_PROBE_NODE_STMT(52,4,2) ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->CR |= ((uint32_t)0x00000001) << DAC_Channel;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable246,249) 

    
    CS_CMM_PROBE_NODE_STMT(52,3,3) ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->CR &= ~(((uint32_t)0x00000001) << DAC_Channel);
  }

CS_CMM_PROBE_NODE_STMT(52,2,4) 
 CODESCROLL_FUNC_END(96, 7, 196) } CODESCROLL_FUNC_END_RBRACE 
/* # 241 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dac.c"*/
void DAC_DMACmd(uint32_t DAC_Channel, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(97, (97, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable247,250) 

  
  CS_CMM_PROBE_NODE_STMT(52,1,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(52,0,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable248,251) 

    
    CS_CMM_PROBE_NODE_STMT(53,7,2) ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->CR |= ((uint32_t)0x00001000) << DAC_Channel;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable249,252) 

    
    CS_CMM_PROBE_NODE_STMT(53,6,3) ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->CR &= ~(((uint32_t)0x00001000) << DAC_Channel);
  }

CS_CMM_PROBE_NODE_STMT(53,5,4) 
 CODESCROLL_FUNC_END(97, 7, 256) } CODESCROLL_FUNC_END_RBRACE 
/* # 268 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dac.c"*/
void DAC_SoftwareTriggerCmd(uint32_t DAC_Channel, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(98, (98, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable250,253) 

  
  CS_CMM_PROBE_NODE_STMT(53,4,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(53,3,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable251,254) 

    
    CS_CMM_PROBE_NODE_STMT(53,2,2) ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->SWTRIGR |= ((uint32_t)0x00000001) << (DAC_Channel >> 4);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable252,255) 

    
    CS_CMM_PROBE_NODE_STMT(53,1,3) ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->SWTRIGR &= ~(((uint32_t)0x00000001) << (DAC_Channel >> 4));
  }

CS_CMM_PROBE_NODE_STMT(53,0,4) 
 CODESCROLL_FUNC_END(98, 7, 283) } CODESCROLL_FUNC_END_RBRACE 
/* # 292 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dac.c"*/
void DAC_DualSoftwareTriggerCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(99, (99, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable253,256) 

  
  CS_CMM_PROBE_NODE_STMT(54,7,0) ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(54,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable254,257) 

    
    CS_CMM_PROBE_NODE_STMT(54,5,2) ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->SWTRIGR |= ((uint32_t)0x00000003) ;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable255,258) 

    
    CS_CMM_PROBE_NODE_STMT(54,4,3) ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->SWTRIGR &= ((uint32_t)0xFFFFFFFC);
  }

CS_CMM_PROBE_NODE_STMT(54,3,4) 
 CODESCROLL_FUNC_END(99, 7, 306) } CODESCROLL_FUNC_END_RBRACE 
/* # 322 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dac.c"*/
void DAC_WaveGenerationCmd(uint32_t DAC_Channel, uint32_t DAC_Wave, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(100, (100, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable256,259) 

  
