irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_dac_1795_IUT.c
  CS_CMM_PROBE_NODE_STMT(54,2,0) ((void)0);
  ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(54,1,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable257,260) 

    
    CS_CMM_PROBE_NODE_STMT(54,0,2) ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->CR |= DAC_Wave << DAC_Channel;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable258,261) 

    
    CS_CMM_PROBE_NODE_STMT(55,7,3) ((DAC_TypeDef *) (((uint32_t)0x40000000) + 0x7400))->CR &= ~(DAC_Wave << DAC_Channel);
  }

CS_CMM_PROBE_NODE_STMT(55,6,4) 
 CODESCROLL_FUNC_END(100, 7, 338) } CODESCROLL_FUNC_END_RBRACE 
/* # 350 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dac.c"*/
void DAC_SetChannel1Data(uint32_t DAC_Align, uint16_t Data)
{ CODESCROLL_FUNC_BEGIN(101, (101, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable259,262) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable260,55,5,0)

  volatile uint32_t tmp = 0;


  ((void)0);
  ((void)0);

  tmp = (uint32_t)(((uint32_t)0x40000000) + 0x7400);
  tmp += ((uint32_t)0x00000008) + DAC_Align;


  *(volatile uint32_t *) tmp = Data;

CS_CMM_PROBE_NODE_STMT(55,4,1) 
 CODESCROLL_FUNC_END(101, 7, 363) } CODESCROLL_FUNC_END_RBRACE 
/* # 375 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dac.c"*/
void DAC_SetChannel2Data(uint32_t DAC_Align, uint16_t Data)
{ CODESCROLL_FUNC_BEGIN(102, (102, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable261,263) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable262,55,3,0)

  volatile uint32_t tmp = 0;


  ((void)0);
  ((void)0);

  tmp = (uint32_t)(((uint32_t)0x40000000) + 0x7400);
  tmp += ((uint32_t)0x00000014) + DAC_Align;


  *(volatile uint32_t *)tmp = Data;

CS_CMM_PROBE_NODE_STMT(55,2,1) 
 CODESCROLL_FUNC_END(102, 7, 388) } CODESCROLL_FUNC_END_RBRACE 
/* # 404 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dac.c"*/
void DAC_SetDualChannelData(uint32_t DAC_Align, uint16_t Data2, uint16_t Data1)
{ CODESCROLL_FUNC_BEGIN(103, (103, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable263,264) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable264,55,1,0)

  uint32_t data = 0, tmp = 0;


  ((void)0);
  ((void)0);
  ((void)0);


  
  CS_CMM_PROBE_NODE_STMT(55,0,1) if (DAC_Align == ((uint32_t)0x00000008))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable265,265) 
    
    CS_CMM_PROBE_NODE_STMT(56,7,2) data = ((uint32_t)Data2 << 8) | Data1;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable266,266) 
    
    CS_CMM_PROBE_NODE_STMT(56,6,3) data = ((uint32_t)Data2 << 16) | Data1;
  }

  
  CS_CMM_PROBE_NODE_STMT(56,5,4) tmp = (uint32_t)(((uint32_t)0x40000000) + 0x7400);
  tmp += ((uint32_t)0x00000020) + DAC_Align;


  *(volatile uint32_t *)tmp = data;

CS_CMM_PROBE_NODE_STMT(56,4,5) 
 CODESCROLL_FUNC_END(103, 7, 428) } CODESCROLL_FUNC_END_RBRACE 
/* # 438 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_dac.c"*/
uint16_t DAC_GetDataOutputValue(uint32_t DAC_Channel)
{ CODESCROLL_FUNC_BEGIN(104, (104, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable267,267) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable268,56,3,0)

  volatile uint32_t tmp = 0;


  ((void)0);

  tmp = (uint32_t) (((uint32_t)0x40000000) + 0x7400) ;
  tmp += ((uint32_t)0x0000002C) + ((uint32_t)DAC_Channel >> 2);


  
  CS_CMM_PROBE_NODE_STMT(56,2,1) 
   CODESCROLL_FUNC_END(104, 7, 449) return (uint16_t) (*(volatile uint32_t*) tmp);
} CODESCROLL_FUNC_END_RBRACE 
